["What manga was drawn by Ryoichi Ikegami?", "Harmony Korine was both screenwriter and director of what movie?", "Where did administrators of the UN Development Programme attend school?", "Who directed a film that had P. Balachandran as a screenwriter?", "The Russian Empire has what ships registered to it?", "What player was selected in the draft by the Seattle Storm?", "Where was a Bishop of Bradford taught?", "What movies did Scott Z. Burns screenwrite?", "What piece of literature did David G. Hartwell edit?", "Which of upstate New York's tallest buildings is located in Buffalo?", "What magazine is a science fiction magazine ?", "For which movie did Mani Ratnam work on the script and serve as producer?", "From which country did Seattle Storm make draft selections?", "What are the discovered bog bodies ?", "What movie had Ivan Pyryev as its screenwriter?", "What music group does Trey Anastasio belong to?", "What is the name of a person who graduated from St. Rose high school?", "who are alumnus of both Upper Canada College and Trinity College?", "Where did a First-Circuit Appeals Court Judge of the United States attend college?", "What does Baojun manufacture?", "Which expressways have their maintenance done by the East Nippon Expressway Company?", "What ship was a Solstice-class cruise ship?", "Who directed the TV show whose screenplay was written by B. J. Novak?", "Which objects used the cloning method in their fabrication?", "What institution featured the design work of Guy Lowell?", "Which movie was both directed and screenwritten by Kamal Haasan?", "Who played in the band Iron Maiden?", "What is a 1923 British film directed by Walter West?", "Arsenal F.C. competed in and won which competition?", "What competition did Naomi Broady win?", "What kind of land mass is found next to the Shackleton Ice Shelf ?", "Joe Pasternak produced a motion picture that was directed by who?", "The Carlyle Group worked for whom?", "Who won a Coke Zero Sugar 400 competition?", "Which movie did Rick Alverson direct?", "Which cities or municipalities are located in the province of Basilan?", "What team emerged victorious in the competition that included the Detroit Tigers?", "Who are the members of the group IRis?", "Which North American Soccer League player transferred to Edmonton in 2016?", "Which musical works did Jason Robert Brown compose?", "What telenovela was executive produced by Ernesto Alonso?", "Who served as Deputy Chief of the General Staff of the Israel Defense Forces?", "Which piece of media did Kay Mellor create?", "The Maryland Transportation Authority is in charge of what landmarks?", "What's the name of an individual who came from Rhodesia?", "What film was directed by Radha Mohan and produced by Prakash Raj?", "What person was taught by Jesus?", "What band is Cedric Bixler-Zavala part of?", "What does Metro-North Railroad own?", "What series was Studio 4°C responsible for producing?", "S. A. Rajkumar composed the music for which film directed by S. Narayan?", "Which software is a text editor ?", "Who employs a consultant?", "Bob Cobert composed the musics for which software, art, etc. directed by Dan Curtis?", "Who has citizenship from Goguryeo?", "Key West National Wildlife Refuge contains which landform?", "Who directed the TV program that Mitchell Burgess wrote for?", "What media organizations does Kevin Terry own?", "For which motion picture did Albert Ward serve as director?", "In which art source are fictional disease mentionned ?", "What are the names of the entities that Glenn T. Seaborg found or created?", "Who was employed by both the Curtis Institute of Music and the Juilliard School?", "Which movie directed by A. Vincent had its music composed by G. Devarajan?", "Who was both a graduate from Ananda College and University of Ceylon?", "Where are the headquarters of areas that are a non metropolitan Roman Catholic archdiocese?", "Which movie had K. S. L. Swamy as its director and Vijaya Bhaskar as its musical composer?", "What tv show is distributed by JTBC?", "Which movie has P. Subramaniam as its director and G. Devarajan as its musical composer?", "What's a book featuring Maurice Sendak's artwork?", "Who spoke Filipino as its mother tongue?", "Which book had illustrations by Pauline Baynes?", "Who directed the film that John Steinbeck wrote?", "Who screen wrote the film that Carlos Baeza directed?", "What are some notables mailing list softwares ?", "Who was responsible for directing the film that Richard Gordon produced?", "What imaginary being was seen for the first time in Guardians of the Galaxy?", "What TV show was first shown on Fuse?", "Martha Graham choreographed what dance?", "What film was directed by B. R. Panthulu with music scored by T. G. Lingappa?", "Which ship calls Baltimore her home port?", "At which institution was a Judge of the United States Court of Appeals for the Second Circuit educated?", "What work of art did Larry Cohen write and direct?", "What work of art was created by artist Fred Barron?", "Who were victims of bomb attacks?", "David E. Kelley was the executive producer for what TV show?", "Which of the Welsh principal areas is a county borough?", "James R. Webb served as screenwriter for which film directed by Joseph Kane?", "What did R. Scott Dunbar discover?", "What movie was scored by Vijaya Bhaskar and directed by Puttanna Kanagal?", "What are the names of the localities in Sweden found in the Säter Municipality?", "What TV show was first broadcast on Asianet?", "What was something that Saipa manufactured?", "Cite all the choral symphonies?", "Who is a Guamanian citizen?", "What movie did Syncopy Inc. produce with Christopher Nolan as the screenwriter?", "What are the objects that were designed by Joan Daemen?", "Which individual works at Julliard and was a Manhattan School of Music alumnus?", "Which properties are maintained by Bridge House Estates?", "Ethan Coen produced what Joel Coen directed film?", "DeVery Freeman was the screenwriter of a movie that was composed by who?"]